In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

from datetime import datetime
import sqlalchemy

### Read From Database

#### 1.Create connection

In [3]:
host='lhl-data-bootcamp.crzjul5qln0e.ca-central-1.rds.amazonaws.com'
port='5432'
user='lhl_student'
pwd='lhl_student'
database='mid_term_project'

#format:dialect+driver://username:password@host:port/database
connection = sqlalchemy.create_engine(f"postgresql://{user}:{pwd}@{host}:{port}/{database}")

#### 2. Use DataFrame to read Data

In [4]:
df=pd.read_sql_query('''SELECT fl_date, arr_delay FROM flights''', connection)

In [5]:
df.head()

      fl_date  arr_delay
0  2018-10-05       11.0
1  2018-10-05       15.0
2  2018-10-05       -3.0
3  2018-10-05       -7.0
4  2018-10-05      -17.0

In [6]:
df_time=pd.read_sql_query('''SELECT crs_dep_time,dep_time,crs_arr_time,arr_time from flights''', connection)

In [8]:
df_time.head()

   crs_dep_time  dep_time  crs_arr_time  arr_time
0          1350    1402.0          1525    1536.0
1          2015    2022.0          2129    2144.0
2          2155    2149.0          2331    2328.0
3          1112    1104.0          1219    1212.0
4           950     944.0          1047    1030.0

In [7]:
df_city=pd.read_sql_query('''SELECT origin_city_name, dest_city_name FROM flights''', connection)

In [9]:
df_city

            origin_city_name      dest_city_name
0               New York, NY       Nashville, TN
1         Salt Lake City, UT           Boise, ID
2            Minneapolis, MN           Minot, ND
3                 Duluth, MN     Minneapolis, MN
4            Minneapolis, MN          Duluth, MN
...                      ...                 ...
15927480       Kalamazoo, MI     Minneapolis, MN
15927481         Chicago, IL     Minneapolis, MN
15927482        Billings, MT  Salt Lake City, UT
15927483  Salt Lake City, UT        Billings, MT
15927484          Duluth, MN     Minneapolis, MN

[15927485 rows x 2 columns]